import collections

text = """За десять місяців 2017 року у Львівській області новонародженим дітям давали найрізноманітніші імена. У текстових файлах boy_names та girl_names зібрані ці імена та біля кожного імені вказано скількох дітей назвали цим іменем. За допомогою функцій пошуку та сортування, які ви розробили на цій лабораторній роботі та з мінімальним використанням вбудованих функцій, знайдіть:

- Які імена були найпопулярніші у 2017 р?

- Скільки імен зустрічалися тільки один раз і що це за імена?

- На яку літеру починається найбільше імен, скільки цих імен і скількох дітей цими іменами назвали (наприклад на літеру 'A' починається 70 імен і 277 дітей назвали цими іменами).

Оцініть, який з варіантів та з якими алгоритмами краще працює з цими обсягами даних. Варіант 1:  використання лінійного пошуку в не відсортованому списку.

Варіант 2: використання бінарного пошуку з попереднім сортуванням списку (сортування можна реалізувати різними алгоритмами).

Дівчатка опрацьовують чоловічі імена, а хлопчики – жіночі.

"""

a = collections.Counter(text.strip().split())
print(a)